snlkuharlocal/src/DataProcessors/ОбработкаЛистовПереукладкиПоЗНА/ОбработкаЛистовПереукладкиПоЗНА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаЛистовПереукладкиПоЗНА</name>
</mdclass:DataProcessor>

snlkuharlocal/src/Documents/ЛистПереукладки/ЛистПереукладки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛистПереукладки</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКороба</name>
    <type>
      <types>CatalogRef.ТипыКоробов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШКСкотча1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШКСкотча2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛистНабора</name>
    <type>
      <types>DocumentRef.ЛистНабора</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуффиксЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШККонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтикеткаРаспечатана</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьПриОпределенииКоличестваМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегации</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодАгрегацииОтсканирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сканировщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСканирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСканирования</name>
    <type>
      <types>EnumRef.РежимСканирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеАгрегации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеТребуетсяСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаАгрегацию</name>
    <type>
      <types>DocumentRef.ЗаданиеНаАгрегацию</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелТСД</name>
    <type>
      <types>ExchangePlanRef.СкладТСД</types>
      <types>ExchangePlanRef.МобильныеТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправленНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СканировщикФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоробки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Завершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтклКонтрольНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КолШтВКоробке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛСК</name>
    <type>
      <types>DocumentRef.ЛистСборкиКомплектовЧЗ</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипШК</name>
      <type>
        <types>EnumRef.ТипыШтрихКодов</types>
      </type>
    </attributes>
    <attributes>
      <name>ШтВКоробе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуетсяМаркировка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоСпайка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодБлочка</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОшибкаСканирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОшибкиСотрудников</name>
    <attributes>
      <name>ВидОшибки</name>
      <type>
        <types>EnumRef.ВидыОшибокСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыКоробокДляАгрегации</name>
    <attributes>
      <name>ИсходныйКодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйКодКоробки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СодержимоеБлочка</name>
    <comment>По ЗНА</comment>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>БлочкиВсего</name>
    <comment>По ЗНА</comment>
    <attributes>
      <name>id_Блочка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковокБлочков</name>
    <comment>заранее забронированные по ЗНА</comment>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>Отсканировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Бригада</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ОбработкаЛистовПереукладкиПоЗНА/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	Если НЕ ВводДоступен() Тогда Возврат КонецЕсли;
	Если НЕ ЭтоСобытиеСканера(Событие) Тогда Возврат КонецЕсли;
	
	глТорговоеОборудование.СканерПосылкаДанных(1);
	глСобытиеСканераОтработано	= Истина;		
	
	ОбработкаДанныхШК(Данные);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДанныхШК(Данные)
	
	Перем ЛП, СсылкаДок;
	
	Данные = СтрЗаменить(Данные,Символы.ПС,"");
	
	Попытка
	
		СсылкаНадок = ЗначениеИзСтрокиВнутр(Данные);
	
	Исключение
	     ОчиститьЗНАНаКлиенте();
		 ОбновитьНадписи("Отсканирован ЗНА:");
		 Сообщить("Не удалось найти ЗНА по ШК. "+ОписаниеОшибки()); 
		 Возврат; 
	КонецПопытки;
	
	ЗНАСсылка = Документы.ЗаданиеНаАгрегацию.ПолучитьСсылку(СсылкаНадок.УникальныйИдентификатор()); 
	 
	Если ЗначениеЗаполнено(ЗНАСсылка) 
		И ТипЗнч(ЗНАСсылка) = Тип("ДокументСсылка.ЗаданиеНаАгрегацию") Тогда
		
		ЗНА = ЗНАСсылка; 		
		
		ЛП = НайтиЛППоЗНА(ЗНА);
		
		Если НЕ ЗначениеЗаполнено(ЛП) Тогда
			
			//	ОбновитьНадписи("Найден необработанный ЛП! " + Строка(ЛП));
			//	
			//	//ОткрытьЗначение(ЛП); 
			//Иначе 
			ОбновитьНадписи("Не найдены ЛП по ЗНА!");
		Иначе 
			ОбновитьНадписи("Отсканирован ЗНА:");
		КонецЕсли;
		
	Иначе 
		ОчиститьЗНАНаКлиенте();  
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ИмитацияСканирования.Видимость = РольДоступна("Администратор");
	ЛистыПереукладки.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаАгрегацию",ЗНА); 
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ОбновитьНадписи(Текст = "")
    Если Не ЗначениеЗаполнено(ЗНА) Тогда 
		Элементы.ДекорацияИнформация.Заголовок = "Отсканируйте ЗНА";
		ЛистыПереукладки.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаАгрегацию",ЗНА);
	ИначеЕсли ЗначениеЗаполнено(Текст) Тогда 
		Элементы.ДекорацияИнформация.Заголовок = Текст; 
    КонецЕсли;
КонецПроцедуры // ОбновитьНадписи()


&НаКлиенте
Процедура ОчиститьЗНА(Команда)
	
	ОчиститьЗНАНаКлиенте();

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗНАНаКлиенте()
	
	ЗНА = ПредопределенноеЗначение("Документ.ЗаданиеНаАгрегацию.ПустаяСсылка");
	
	ОбновитьНадписи();

КонецПроцедуры 

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция НайтиЛППоЗНА(Знач ЗНА)
	
    ЛистыПереукладки.Параметры.УстановитьЗначениеПараметра("ЗаданиеНаАгрегацию",ЗНА);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЛистПереукладки.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЛистПереукладки КАК ЛистПереукладки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЛистПереукладки.Товары КАК ЛистПереукладкиТовары
		|		ПО (ЛистПереукладкиТовары.Ссылка = ЛистПереукладки.Ссылка)
		|ГДЕ
		|	ЛистПереукладки.Проведен
		//|	И ЛистПереукладки.ДокОснование = &ДокОснование
		//|	И (ЛистПереукладкиТовары.Ссылка ЕСТЬ NULL
	//	|			ИЛИ ЛистПереукладкиТовары.Количество <> ЛистПереукладкиТовары.Отсканировано)
		//|	И НЕ ЛистПереукладки.Завершен
		|	И ЛистПереукладки.ЗаданиеНаАгрегацию = &ЗаданиеНаАгрегацию
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛистПереукладки.Дата";
	
//	Запрос.УстановитьПараметр("ДокОснование", ЗНА.ДокОснование);
	Запрос.УстановитьПараметр("ЗаданиеНаАгрегацию", ЗНА);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
		Возврат ВыборкаДетальныеЗаписи.ссылка; 
	КонецЕсли;

    Возврат Неопределено; 
КонецФункции // НайтиНеОтсканированныйЛП()

&НаКлиенте
Процедура ИмитацияСканированияПриИзменении(Элемент)
	ОбработкаДанныхШК(ИмитацияСканирования); 
КонецПроцедуры
